// - Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години попадає число
// (в першу, другу, третю или четверту частину години).
//=================================================================
// let time = prompt('Введіть час від 0 до 59');
// if (time<1 || time>59) {
//     console.log('Введіть коректне число для номера хвилини');
// } else if (time<15) {
//     console.log('Перша чверть');
// } else if (time<30) {
//     console.log('Друга чверть');
// } else if (time<45) {
//     console.log('Третя чверть');
// } else {
//     console.log('Четверта чверть');
// }
//=================================================================
// - У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю).
//=================================================================
// let day = prompt('Введіть день від 1 до 31');
// if (day<1 || day>31) {
//    console.log('Введіть корентний день');
// } else if (day<11) {
//    console.log('Перша декада');
// } else if (day<21) {
//     console.log('Друга декада');
// } else {
//     console.log('Третя декада');
// }
//=================================================================
// - У нас є змінна test, якщо дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.
//     Перевірте роботу скрипта при test, що дорівнює true, false. Напишіть два варіанти скрипта - з коротким записом(тернаркою)
//=================================================================
// let test = 'sadd';
// if (test===true) {
//     console.log('Вірно');
// } else {
//     console.log('Неправильно');
// }
//============================Тернанкою============================
// let testres = (test===true) ? console.log('Вірно') : console.log('Неправильно');
// - Якщо змінна a не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте  скрипт при a, що дорівнює 1, 0, -3
//=================================================================
// let a = 0;
// if (a!==0) {
//     console.log('Вірно');
// } else {
//     console.log('Невірно');
// }
//============================Тернанкою============================
// let ares = (a!==0) ? console.log('Вірно') : console.log('Невірно');
//=================================================================
// - Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня і на екрані відображається інфа що заплановано на цей день.
//=================================================================
// let dayOFweek = prompt('Введіть день тижня від 1 до 7');
// switch (dayOFweek) {
//     case 1 :
//         console.log('Понеділок');
//         break;
//     case 2 :
//         console.log('Вівторок');
//         break;
//     case 3 :
//         console.log('Середа');
//         break;
//     case 4 :
//         console.log('Четвер');
//         break;
//     case 5 :
//         console.log('Пятниця');
//         break;
//     case 6 :
//         console.log('Субота');
//         break;
//     case 7 :
//         console.log('Неділя');
//         break;
//     default:
//         console.log('Напиши нормально');
// }
//=================================================================
// - Потрібно визначити Високосний рік чи ні. Високосні роки діляться націло на 4.
//=================================================================
// let year = +prompt('Який зараз рік?');
// if (year%4===0) {
//     console.log('Цей рік високосний');
// } else {
//     console.log('Цей рік не високосний');
// }
//=================================================================
// - Використовуючи конструкцію if..else, напишіть код, який запитуватиме: „Яка «офіційна» назва JavaScript?“
// Якщо користувач вводить «ECMAScript», то показати: «Правильно!», інакше – відобразити: «Не знаєте? ECMAScript!
//=================================================================
// let namescrpt = prompt('Яка «офіційна» назва JavaScript');
// if (namescrpt ==='ECMAScript') {
//     document.write('Правильно');
// } else {
//     document.write('Hе знаєте? ECMAScript!');
// }
//=================================================================
