// - створити функцію яка обчислює та повертає площу прямокутника зі сторонами а і б
// function pryamS (a,b) {
//     let S = a*b;
//     return S;
// }
// console.log(pryamS(2,6));
//======================================================================================================================
// - створити функцію яка обчислює та повертає площу кола з радіусом r
// function kolS(r) {
//     let S = Math.PI*Math.pow(r, 2);
//     return Math.floor(S);
// }
// console.log(kolS(2));
//======================================================================================================================
// - створити функцію яка обчислює та повертає площу циліндру висотою h, та радіутом r
// function cylS(h,r) {
//     return  2*Math.PI*r*h;
// }
// console.log(Math.floor(cylS(5,2)));
//======================================================================================================================
// - створити функцію яка приймає масив та виводить кожен його елемент
// let users = [
//     {name: 'vasya', age: 31, status: false},
//     {name: 'petya', age: 30, status: true},
//     {name: 'kolya', age: 29, status: true},
//     {name: 'olya', age: 28, status: false},
//     {name: 'max', age: 30, status: true},
//     {name: 'anya', age: 31, status: false},
//     {name: 'oleg', age: 28, status: false},
//     {name: 'andrey', age: 29, status: true},
//     {name: 'masha', age: 30, status: true},
//     {name: 'olya', age: 31, status: false},
//     {name: 'max', age: 31, status: true}
// ];
// function arrayGo(array) {
//     for(let arrfill of array) {
//         console.log(arrfill);
//     }
// }
// arrayGo(users);
//======================================================================================================================
// - створити функцію яка створює параграф з текстом. Текст задати через аргумент
// function paragraff(txt) {
//     document.write(`<p>${txt}</p>`);
// }
// paragraff("sadasfg gs  fa sd afd asfas f");
//======================================================================================================================
// - створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий
// function similarLi(txtLi) {
//     document.write(`<ul>`);
//     for (let i = 0; i < 3; i++) {
//         document.write(`<li>${txtLi}</li>`)
//     }
//     document.write(`</ul>`);
// }
// similarLi("safasf");
//======================================================================================================================
// - створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий. Кількість li визначається другим аргументом, який є числовим (тут використовувати цикл)
// function similarLi(txtLi, num) {
//     document.write(`<ul>`);
//     for (let i = 0; i < num; i++) {
//         document.write(`<li>${txtLi}</li>`)
//     }
//     document.write(`</ul>`);
// }
// similarLi("safasf", 100);
//======================================================================================================================
// - створити функцію яка приймає масив примітивних елементів (числа,стрінги,булеві), та будує для них список
// let randar = [2, true, "sada", false, "asda", "sada", 34, 532];
// function spys(array) {
//     document.write(`<ul>`);
//     for (let i = 0; i < array.length; i++) {
//         document.write(`<li>${array[i]}</li>`)
//     }
//     document.write(`</ul>`);
// }
// spys(randar);
//======================================================================================================================
// - створити функцію яка приймає масив об'єктів з наступними полями id,name,age , та виводить їх в документ. Для кожного об'єкту окремий блок.
// let users = [
//     {id:1, name: "asda", age: 25},
//     {id:2, name: "ghk", age: 65},
//     {id:3, name: "saf", age: 59},
//     {id:4, name: "n,", age: 32},
// ];
// function arOj(array) {
//     for (let i = 0; i<array.length; i++) {
//         document.write(`<div>${array[i].id} - ${array[i].name} - ${array[i].age}</div>`);
//     }
// }
// arOj(users);
//======================================================================================================================